
{
    "winterfell": {
        "title": "Winterfell",
        "description": "Winterfell is the seat of the ruler of the North and the ancestral home of House Stark. It is a very large castle located at the center of the North, from where the head of House Stark rules over his or her people. A small Godswood is enclosed within the walls. It is the regional capital of the North under Jon Snow. The castle is located alongside the Kingsroad as it makes its way from the Wall to the capital of the Seven Kingdoms, King's Landing, more than a thousand miles to the south.\n\n It is situated atop hot springs which keep the castle warm even in the worst winters. Winding tombs below the castle contain the remains of Stark kings and lords and record the history of the ancient family. According to maester Luwin, there are hidden passageways built in the castle so its Lords could escape. The castle has stood for millennia.\n\n The castle was put to the torch by Ramsay Snow after Theon Greyjoy was betrayed by his own crew. This burned out the wood portions of the castle, though the core stone structures remained fundamentally intact, as did the enclosed godswood. After the surrender of Moat Cailin, the Bolton army relocated to the ruined castle in order to restore it as the seat of the rulers of the North.\n\n Winterfell remained in Bolton hands for a time until their defeat at the Battle of the Bastards, at which point the castle was returned to House Stark's ownership. It is currently jointly the seat of Jon Snow – the Warden of the North – and Sansa Stark, the Lady of Winterfell.",
        "image": "winterfell"
    },
    
    "kings_landing": {
        "title": "King's Landing",
        "description": "King's Landing is the capital, and largest city, of the Seven Kingdoms. Located on the east coast of Westeros in the Crownlands, just north of where the Blackwater Rush flows into Blackwater Bay and overlooking Blackwater Bay, King's Landing is the site of the Iron Throne and the Red Keep, the seat of the King of the Andals and the First Men. It enjoys a warm climate and life there is luxurious for those that can afford it, although it is not without its slums such as Flea Bottom. The city is overpopulated and dangerous at the best of times, despite being policed by the City Watch.\n\nKing's Landing was founded by King Aegon I Targaryen, King of the Andals and the First Men. He established a small wooden fort atop the hill, named the Aegonfort in his honor, where his ships first landed from Dragonstone, and used this as a base for his campaign to conquer the continent. Having achieved his goal, he established the new capital on the site of his original fort. The city expanded rapidly under his descendants. By the time of Robert's Rebellion, the city had a population of approximately half a million people.\n\nKing's Landing has suffered occasional attacks during its existence, most notably during the civil war known as Robert's Rebellion, when Lord Tywin Lannister betrayed King Aerys II Targaryen and ordered his army to brutally sack the city before turning it over to Robert Baratheon as a sign of fealty.\n\nDuring the War of the Five Kings, the problems in King's Landing have multiplied. The worst of these are the food shortages exacerbated by an influx of refugees into the city seeking the protection of the city walls from the war, this even led to a riot at one point early into the war during which the High Septon, and Aron Santagar perished, along with many other citizens.\n\nDespite its opulence and status as the capital, King's Landing is often referred to in a derisive manner by outsiders. A recurring theme is the stench of human waste; the crowded population and sea breeze means such smells are particularly pungent.",
        "image": "kings_landing"
    },
    
    "braavos": {
        "title": "Braavos",
        "description": "Braavos is one of the Free Cities located to the east of Westeros. It is the northern-most, the richest, and arguably the most powerful of the Free Cities. Described as a city of seafarers and master swordsmen, Braavos consists of hundreds of tiny islands connected by stone bridges. Its main landmarks include the Titan of Braavos, the House of Black and White and the city's famed Iron Bank.\n\nThe people of Braavos are known as Braavosi.",
        "image": "braavos"
    }
}
