
{
    "winterfell": {
        "title": "Winterfell",
        "description": "Winterfell is the seat of the ruler of the North and the ancestral home of House Stark. It is a very large castle located at the center of the North, from where the head of House Stark rules over his or her people. A small Godswood is enclosed within the walls. It is the regional capital of the North under Jon Snow. The castle is located alongside the Kingsroad as it makes its way from the Wall to the capital of the Seven Kingdoms, King's Landing, more than a thousand miles to the south.\n\n It is situated atop hot springs which keep the castle warm even in the worst winters. Winding tombs below the castle contain the remains of Stark kings and lords and record the history of the ancient family. According to maester Luwin, there are hidden passageways built in the castle so its Lords could escape. The castle has stood for millennia.\n\n The castle was put to the torch by Ramsay Snow after Theon Greyjoy was betrayed by his own crew. This burned out the wood portions of the castle, though the core stone structures remained fundamentally intact, as did the enclosed godswood. After the surrender of Moat Cailin, the Bolton army relocated to the ruined castle in order to restore it as the seat of the rulers of the North.\n\n Winterfell remained in Bolton hands for a time until their defeat at the Battle of the Bastards, at which point the castle was returned to House Stark's ownership. It is currently jointly the seat of Jon Snow – the Warden of the North – and Sansa Stark, the Lady of Winterfell.",
        "image": "winterfell"
    },
    
    "kings_landing": {
        "title": "King's Landing",
        "description": "King's Landing is the capital, and largest city, of the Seven Kingdoms. Located on the east coast of Westeros in the Crownlands, just north of where the Blackwater Rush flows into Blackwater Bay and overlooking Blackwater Bay, King's Landing is the site of the Iron Throne and the Red Keep, the seat of the King of the Andals and the First Men. It enjoys a warm climate and life there is luxurious for those that can afford it, although it is not without its slums such as Flea Bottom. The city is overpopulated and dangerous at the best of times, despite being policed by the City Watch.\n\nKing's Landing was founded by King Aegon I Targaryen, King of the Andals and the First Men. He established a small wooden fort atop the hill, named the Aegonfort in his honor, where his ships first landed from Dragonstone, and used this as a base for his campaign to conquer the continent. Having achieved his goal, he established the new capital on the site of his original fort. The city expanded rapidly under his descendants. By the time of Robert's Rebellion, the city had a population of approximately half a million people.\n\nKing's Landing has suffered occasional attacks during its existence, most notably during the civil war known as Robert's Rebellion, when Lord Tywin Lannister betrayed King Aerys II Targaryen and ordered his army to brutally sack the city before turning it over to Robert Baratheon as a sign of fealty.\n\nDuring the War of the Five Kings, the problems in King's Landing have multiplied. The worst of these are the food shortages exacerbated by an influx of refugees into the city seeking the protection of the city walls from the war, this even led to a riot at one point early into the war during which the High Septon, and Aron Santagar perished, along with many other citizens.\n\nDespite its opulence and status as the capital, King's Landing is often referred to in a derisive manner by outsiders. A recurring theme is the stench of human waste; the crowded population and sea breeze means such smells are particularly pungent.",
        "image": "kings_landing"
    },
    
    "braavos": {
        "title": "Braavos",
        "description": "Braavos is one of the Free Cities located to the east of Westeros. It is the northern-most, the richest, and arguably the most powerful of the Free Cities. Described as a city of seafarers and master swordsmen, Braavos consists of hundreds of tiny islands connected by stone bridges. Its main landmarks include the Titan of Braavos, the House of Black and White and the city's famed Iron Bank.\n\nThe people of Braavos are known as Braavosi.",
        "image": "braavos"
    },
    
    "harrenhal": {
        "title": "Harrenhal",
        "description": "Harrenhal is a huge castle, the largest one in all of Westeros, though it is also the most ill-omened. It is located on the northern shore of the Gods Eye lake at the heart of the Riverlands, south of the River Trident and northwest of King's Landing.",
        "image": "harrenhal"
    },
    
    "castle_black": {
        "title": "Castle Black",
        "description": "Castle Black is the primary headquarters and redoubt of the Night's Watch. It is located roughly halfway along the length of the Wall on its southern side, at the northern end of the Kingsroad. It is a dark and chilling home to its garrison.\nCastle Black is one of only three manned castles left on the Wall along with Eastwatch-by-the-Sea and The Shadow Tower. There are nineteen castles along the Wall, but as their numbers fell over the centuries, the Night's Watch had to abandon sixteen of them. Castle Black is located between the unmanned castles of Queensgate and Oakenshield.\n\nCastle Black has a sept, but no Godswood. Those who are followers of the Old Gods of the Forest must travel a mile north of the Wall and into the Haunted Forest to take their vows before a heart tree.\n\nAfter learning of the breaching of the Wall, Jon Snow orders the remaining castles on the Wall be abandoned and for their garrisons to come to Winterfell.",
        "image": "castle_black"
    },
    
    "highgarden": {
        "title": "Highgarden",
        "description": "Highgarden was the seat of House Tyrell and the regional capital of the Reach. Located on the banks of the river Mander, Highgarden sits astride the Roseroad, a major thoroughfare linking Oldtown and King's Landing. Highgarden also forms the southern terminus of the the Searoad, which leads to Lannisport. As King's Landing, Oldtown, and Lannisport are the first, second, and third largest cities in the realm, heavy trade and traffic across a large swath of southern Westeros ultimately passes through Highgarden.\n\nThe golden roses and green fields that surround Highgarden serves as the inspiration for the Tyrell sigil and heraldry.\n\nIn Tyrell possession since Aegon's Conquest, more than three centuries ago, Highgarden was captured and sacked by forces of House Lannister and House Tyrell's formerly loyal vassals House Tarly, with its resources plundered, in the name of Queen Cersei Lannister. With the death of Lady Olenna Tyrell, the castle's ownership is uncertain.",
        "image": "highgarden"
    },
    
    "sunspear": {
        "title": "Sunspear",
        "description": "Sunspear is the capital of Dorne, southernmost of the Seven Kingdoms, located in the far southeast of the continent on the Summer Sea. It consists of a strong, fortified castle and a town that sprawls around it. It is a town built largely of mud and straw. The town's largest structure is Spear Tower, a 150-feet structure with a pinnacle of shining steel.\n\nThe castle was the seat of House Martell, Princes of Dorne, until the family was legally wiped out by Ellaria Sand and the three eldest Sand Snakes, who seized power through a coup. With the latter dead and the former imprisoned for life in King's Landing following a naval assault, the castle's ownership is uncertain.",
        "image": "sunspear"
    },
    
    "the_eyrie": {
        "title": "The Eyrie",
        "description": "The Eyrie is the principal stronghold of House Arryn. It is located in the Vale of Arryn near the east coast of Westeros. The Eyrie straddles the top of a peak in the Mountains of the Moon several thousand feet above the valley floor below. It is approached by a narrow causeway and road. Those who would approach the Eyrie must pass through three way-castles guarding the ascent - and then, must proceed in single file, making them very vulnerable to archers. For these reasons, the Eyrie is considered impregnable to any attack that does not involve dragons, and its defenses have never been overcome. It is currently the seat of Robin Arryn – the Warden of the East.\n\nThe High Hall of the Eyrie is the main audience chamber, where the Lord of the Vale greets visitors from a throne made of weirwood. A notable feature of the chamber is the moon door, a hatch built into the floor through which people can fall to the floor of the Vale far below. Being thrown through the moon door is the preferred method of execution at the Eyrie.\n\nPrisoners at the Eyrie are incarcerated in the sky cells, cells which are open on one side to the air. There is a very slight slope in the cells, and prisoners must be careful not to roll out of the cell in their sleep and plummet to their deaths.",
        "image": "the_eyrie"
    },
    
    "riverrun": {
        "title": "Riverrun",
        "description": "Riverrun is the former seat of House Tully, which is now occupied by its new lawful rulers House Frey. It is a large castle located in the central-western part of the Riverlands. It sits at the point where the Red Fork of the Trident River is joined by its major tributary, the Tumblestone River flowing out of the west. In times of danger, sluice gates can be opened to flood a channel cut to the west of the castle, turning Riverrun into an island. Its walls rise sheer from the waters and its towers command the opposite shores, making assaulting it almost impossible without huge casualties.",
        "image": "riverrun"
    },
    
    "pyke": {
        "title": "Pyke",
        "description": "Pyke is the stronghold and seat of House Greyjoy, located on the island of the same name, which is one of the seven major Iron Islands. The castle is the regional capital of the Iron Islands as a whole. Pyke is an ancient stronghold and the cliff it was built on has been eroded by the sea leaving the towers standing on stone stacks. The towers are connected by swaying rope bridges. The rocky moss covered stone at its base is not suitable for ships landing so traffic to the island flows through the nearby harbor town Lordsport. It is currently the seat of Euron Greyjoy – the King of the Iron Islands.\n\n'Pyke' is also the name given to bastards born on the Iron Islands.",
        "image": "pyke"
    },
    
    "oldtown": {
        "title": "Oldtown",
        "description": "Oldtown is the second largest city in the Seven Kingdoms, and by far the oldest major city in Westeros, dating back to the time of the First Men. It is located in the far southwest of the continent, at the mouth of the River Honeywine where it opens into Whispering Sound and the Sunset Sea beyond.\n\nThe major highway known as the Roseroad begins at Oldtown, then runs northeast past Highgarden before finally reaching King's Landing on the east coast. The Searoad also forks off from the Roseroad at Highgarden, going northwest so travelers from Oldtown can reach Lannisport.\n\nOldtown is the seat of House Hightower, who hold fealty to House Tyrell of Highgarden, from the eponymous Hightower. The city is also notable as the site of the Citadel, home of the order of maesters, as well as the Starry Sept, the former center of the Faith of the Seven in Westeros (it has since been supplanted by the Great Sept of Baelor in King's Landing).",
        "image": "oldtown"
    },
    
    "casterly_rock": {
        "title": "Castetly Rock",
        "description": "Casterly Rock is the ancestral stronghold of House Lannister. It is located on the Western coast of Westeros on a rocky promontory overlooking the Sunset Sea. It overlooks the major city of Lannisport. A major goldmine is located under Casterly Rock. It is one of the most productive in the realm and provides House Lannister with their wealth.\n\nAccording to legend, Casterly Rock was found and held by House Casterly after its founder slew a pair of fearsome lions that lived in the gold-filled subterranean cave where the castle would be built upon. They were hoodwinked into giving the Rock to Lann the Clever, a legendary trickster and ancestor of House Lannister, thousands of years ago, during the Age of Heroes.\n\nThe castle was briefly controlled by the Unsullied forces of House Targaryen, whose victory over the Lannister forces was pyrrhic.",
        "image": "casterly_rock"
    },
    
    "lannisport": {
        "title": "Lannisport",
        "description": "Lannisport is a large city located on the west coast of Westeros, on the Sunset Sea just south of Casterly Rock, the seat of House Lannister. A cadet branch of the Lannisters rules the city in the name of Queen Cersei Lannister. It is a bustling seaport.",
        "image": "lannisport"
    }
}
